<a href="https://colab.research.google.com/github/ilham-mukti/Machine-Learning/blob/main/Latihan_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [6]:
a = [1,2,3]
contoh = {'asu':a, 'b':[4,5,6], 'c':[7,8,9]}
pd.DataFrame(contoh)

# **Membaca data dari File**

In [13]:
datas = pd.read_csv("/content/sample_data/california_housing_train.csv")
datas.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [14]:
datas.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [21]:
datas.dtypes

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
dtype: object

In [28]:
datas[ ['population', 'households'] ].head()

   population  households
0      1015.0       472.0
1      1129.0       463.0
2       333.0       117.0
3       515.0       226.0
4       624.0       262.0

# **Slicing**

In [31]:
datas[ ['population', 'households'] ][1:5]

   population  households
1      1129.0       463.0
2       333.0       117.0
3       515.0       226.0
4       624.0       262.0

In [32]:
datas.loc[1:4, 'population': 'median_house_value']

   population  households  median_income  median_house_value
1      1129.0       463.0         1.8200             80100.0
2       333.0       117.0         1.6509             85700.0
3       515.0       226.0         3.1917             73400.0
4       624.0       262.0         1.9250             65500.0

In [33]:
datas.loc[1:4, ['population', 'median_house_value', 'total_bedrooms']]

   population  median_house_value  total_bedrooms
1      1129.0             80100.0          1901.0
2       333.0             85700.0           174.0
3       515.0             73400.0           337.0
4       624.0             65500.0           326.0